"-------------------------------------------------------------
" 設定
"-------------------------------------------------------------

" 文字コードをUTF-8に設定
set fenc=utf-8
" バックアップファイルを作らない
set nobackup
" スワップファイルを作らない
set noswapfile
" 編集中のファイルが変更されたら自動で読み直す
set autoread
" バッファが編集中でもその他のファイルを開けるように
set hidden
" 入力中のコマンドをステータスに表示する
set showcmd

"-------------------------------------------------------------
" 見た目系
"-------------------------------------------------------------

" タイトルを表示
set title
" 行番号を表示
set number
" 現在の行を強調表示
set cursorline
" 現在の行を強調表示（縦）
set cursorcolumn
" 行末の1文字先までカーソルを移動できるように
set virtualedit=onemore
" インデントはスマートインデント
set smartindent
" ビープ音を可視化
set visualbell
" 括弧入力時に対応する括弧を表示
set showmatch matchtime=1
" ステータスラインを常に表示
set laststatus=2
" コマンドラインの補完
set wildmode=list:longest 
" 行末のスペースを可視化
set listchars=tab:^\ ,trail:~
" 折り返し時に表事業単位での移動できるように
nnoremap j gj
nnoremap k gk
" シンタックスハイライトの有効化
syntax enable

"-------------------------------------------------------------
" Tab系
"-------------------------------------------------------------
" 不可視文字を可視化（タブが「▸-」と表示される)
set list listchars=tab:\▸\-
" Tab文字を半角スペースにする
set expandtab
" 行頭以外のTab文字の表示幅（スペースいくつ分）
set tabstop=2
" 行頭でのTab文字の表示幅
set shiftwidth=2

"-------------------------------------------------------------
" 検索系
"-------------------------------------------------------------
" 検索文字列が小文字の場合は大文字小文字を区別なく検索する
set ignorecase
" 検索文字列に大文字が含まれている場合は区別して検索する
set smartcase
" 検索文字入力時に順次対象文字列をヒットさせる
set incsearch
" 検索時に最後まで行ったら最初に戻る
set wrapscan
" 検索後をハイライト表示
set hlsearch



" ヤンクがクリップボードに保持されるようにする
set clipboard+=unnamed

" 連続してペーストできるようにする
xnoremap p pgvy
